TaskName = "Digitaalinen faksien arkistointi";

//progress bar string when reading/writing the information from the device
"TEST_PROGRESS_TITLE" = "Testaus käynnissä… Odota.";
"DEVICE_COMMUNICATION_SETTINGS" = "Kirjoitetaan asetuksia laitteelle… Odota.";
"DEVICE_COMMUNICATION_HOST" = "Kirjoitetaan isäntänimeä laitteelle… Odota.";

//Titles of Buttons
"AUTO_TEXT" = "Autom.";
"OK" = "OK";
"HOST_TITLE" = "Vastaanotetaan fakseja: %@";
"SELECT_FOLDER" = "Valitse kansio…";
"SELECT_EMAIL" = "Sähköpostiasetukset…";
"FOLDER_SELECTION_BUTTON_TITLE" = "Valitse";
"FOLDER_SELECTION_PANEL_TITLE" = "Valitse kansio";

/* Error strings*/

"GENERAL_DATA_MISSING_DESCRIPTION" = "Yhdessä tai usemmassa kentässä ei ole tietoja. Täydennä kaikki kentät tai valitse Peruuta.";
"GENERAL_DATA_MISSING_TITLE" = "Virhe: puuttuvia tai virheellisiä tietoja";
"MISSING_FOLDER_SETTING" = "Osa kohdekansion tiedoista puuttuu. Valitse kansio, anna käyttäjänimi ja salasana ja yritä sitten uudelleen.";

"SUCCESS" = "Onnistunut";
"FOLDER_SETTINGS_SUCCESS" = "HP:n digitaalinen faksi on määritetty. Saapuvat mustavalkoiset faksit tallennetaan jatkossa kansioon \"%@\".";
"EMAIL_SETTINGS_SUCCESS" = "HP:n digitaalinen faksi on määritetty. Saapuvat mustavalkoiset faksit lähetetään jatkossa sähköpostiliitteinä osoitteeseen \"%@\".";


"AFP Authentication" = "AFP-palvelimen todennus";
"SMB Authentication" = "SMB/CIFS-tiedostojärjestelmän todennus";

"ENTER_SERVER_DETAILS_ERROR_TITLE" = "Anna palvelimen tiedot";
"ENTER_SERVER_DETAILS_ERROR_DESC" = "Anna kaikki palvelimen tiedot.";

/* Error string when connecting */
HSDFolderWithPercentSignTitleFormat = "Kansiota %@ ei voi käyttää";
HSDFolderWithPercentSignDescription = "Käytä sellaista kansion nimeä, jossa ei ole prosenttimerkkiä.";

"CONNECTION_FAILED_TITLE" = "Yhteys epäonnistui";
"CONNECTION_FAILED_DESC" = "Palvelinta ei ehkä ole olemassa tai se ei ole toiminnassa. Tarkista palvelimen nimi tai IP-osoite ja yritä uudelleen.";

"AUTH_FAILED_TITLE" = "Todennus epäonnistui";
"AUTH_FAILED_DESC" = "Käyttäjä on tuntematon, salasana virheellinen tai käyttäjätili on poistettu. Anna nimi ja salasana uudelleen tai ota yhtettä palvelimen järjestelmänvalvojaan.";

"UNHANDLED_ERROR_TITLE" = "Odottamaton virhe";
"UNHANDLED_ERROR_DESC" = "Yritettäessä muodostaa yhteyttä palvelimeen tapahtui virhe %d.";

HSDServerParametersErrorTitle = "Epätäydelliset palvelintiedot";
HSDServerParametersErrorDescription = "Palvelintietokentät eivät voi olla tyhjiä. Anna kaikki vaaditut palvelintiedot ja yritä uudelleen.";

HSDUnableToSelectFolderTitle = "Valittua kansiota ei voi käyttää";
HSDPermissionsErrorDescription = "Käyttöoikeutesi eivät riitä valittuun kansioon kirjoittamiseen. Valitse jokin toinen kansio ja yritä uudelleen.";
"MISSING_SERVER_CREDENTIALS" = "Palvelimen kirjautumistiedot puuttuvat. Anna käyttäjänimi ja salasana ja yritä sitten uudelleen.";

HSDProtocolErrorDescription = "Valittua kansiota ei löydy määritetyltä palvelimelta tai yhteys palvelimeen on muodostettu eri tiedostonjakoprotokollan avulla.";

//Progress title when printing the list
"PRINT_PROGRESS_TITLE" = "Tulostetaan… Odota";

//progress title while initializing the print
"PRINT_INITIALIZING_TITLE" = "Käsitellään…";


//Max limit for fax blocking list reached error
"BLOCK_FAX_ERROR_TITLE" = "Esstettyjen numeroiden enimmäismäärä täynnä";
"BLOCK_FAX_ERROR_DESC" = "Laite voi tallentaa enintään %d estettyä faksinumeroa. Poista joidenkin faksinumeroiden esto ja yritä uudelleen.";

//Fax log results
"ERROR" = "Virhe";
"BUSY" = "Varattu";
"NO_ANSWER" = "Ei vastausta";
"NO_DIAL_TONE" = "Ei valintaääntä";
"NO_DOCUMENT" = "Ei asiakirjaa";
"DOCUMENT_JAM" = "Paperitukos";
"DOOR_OPEN" = "Luukku auki";
"POWER_FAILURE" = "Virtavirhe";
"BLACKLISTED" = "Mustalla listalla";
"STORAGE_FULL" = "Tallennus täynnä";
"OUT_OF_MEMORY" = "Muisti täynnä";
"PHONE_LINE_UNAVAILABLE" = "Puhelinlinja ei käytettävissä";
"FAX_DISCONNECTED" = "Ei faksiyhteyttä";
"PC_DISCONNECTED" = "Ei tietokoneyhteyttä";
"REMOTE_NOT_COLOR" = "Etä - ei väriä";
"COMMUNICATION_ERROR" = "Tiedonsiirtovirhe";
"CANCELLED" = "Peruutettu";

//Fax session types
"SENT" = "Lähetetty";
"RECEIVED" = "Vastaanotettu";
